<template>
  
    	
        已连续签到的天数{{db.sign_num}}
        今天是否已经签到{{db.type}}

        <!--//sign_num       :已连续签到的天数
        //type			:今天是否已经签到 0：没有 1：已签到-->
        
        
        
        <!--1. 积分规则
（1）购物可获得积分，每购物1元产生1积分,以此类推。
（2）签到可获得积分，签到一日即可获得20积分。连续签到一周可额外获得20积分，连续签到一个月可额外获得100积分。
(3)转发公众号图文至朋友圈可获得积分，通过点击您的链接后而产生的阅读量每一个阅读量为1个积分，以此类推！每超过1000阅读量客外增加100积分，每增加一条收藏将获得10积分！每一条入选评论将获得10积分。

2.积分使用
（1）本积分仅可在智盟+使用。
（2）积分可直接用于支付智盟+商品订单，购物时直接抵现使用。
（3）购物1元即获得1积分，100积分抵扣1人民币。 
 (4 )积分只能在本商城内购物抵现使用，不能直接抵换现金。

3.积分查询
您可以在“个人中心-我的积分”中可查询到您的积分详细情况。

4.积分生效与清除说明
(1)购物时确认收货积分即刻到账；签到与转发积分即时到账。
(2)用户获得但未使用的积分，将在下一个自然年底过期，智盟+将定期对过期积分进行作废处理。例2015年12月31日将清空2014年度客户获得但未使用的积分。-->
 
        <button @tap="submit">签到</button>
    </div>
</template>
<style scoped>

</style>
<script>
export default {
    mounted(){
        this.$api("Member/signinfo").then(db=>{
            this.db=db;
        });
    },
    components: {},
    data(){
        return{
            db:{
                sign_num:0,
                type:0
            }
        }
    },
    computed:{
    },
    watch:{

    },
    methods:{
        submit(){
            this.$api("Member/setsign").then((db)=>{
                mui.toast(db.info);//签到成功
            });
        }
    }
    }
</script>